Repository: moses-mugoya/Online-Cloth-Shopping-System
Catalog: catalog/locale/*/LC_MESSAGES/django.po
Languages: sw

source: review
sw: tathmini

source: Email
sw: Barua pepe

source: Body
sw: Mwili

source: Home
sw: Nyumbani

source: Search
sw: Tafuta

source: Help Center
sw: Usaidizi

source: My dashboard
sw: Dashibodi yangu

source: Your cart
sw: Gari lako

source: Your cart is empty
sw: Gari lako ni tupu

source: Logout
sw: Toka nje

source: Sign Up
sw: Jisajili

source: Log-in
sw: Ingia

source: Language
sw: Lugha

source: Available stock
sw: Hisa zilizoko

source: Available stock: depleted
sw: Hisa zilizoko: zimekwisha

source: Add to cart
sw: Ongeza kwa gari

source: Write a Review
sw: Andika tathmini

source: There are no reviews for this product yet
sw: Hakuna tathmini kwa hii bidhaa

source: Leave a feedback
sw: Acha maoni

source: Send Feedback
sw: Tuma maoni

source: How to place an order
sw: Jinsi ya kuagiza

source: Navigate through the products and select the products you want to purchase by clicking on the product
sw: Nenda kupitia bidhaa na uchague bidhaa unayotaka kununua kwa kubonyeza bidhaa

source: Click on the product you want to purchase the add it to the cart
sw: Bonyeza bidhaa unayotaka kisha ongeza kwenye gari

source: Once you have exhausted your cart, click the checkout button and proceed to placing an order
sw: Mara tu umejaza gari lako, bofya kifungo cha kuangalia na uendelee kuweka agizo

source: All
sw: Yote

source: Men clothing
sw: Nguo za wanaume

source: Shirts
sw: Mashati

source: Trousers
sw: Suruali

source: Suit
sw: Suti

source: Sweaters
sw: Sweta

source: Women clothing
sw: Nguo za wanawake

source: Dresses
sw: Rinda

source: Blouses
sw: Blauzi

source: Shoes
sw: Viatu

source: Others
sw: Mengineyo

source: Most recent items
sw: Bidhaa vya hivi karibuni

source: Most reviewed items
sw: Bidhaa vyema zaidi

source: Most purchased items
sw: Bidhaa 'zonunuliwa zaidi

source: Subscribe to our RSS feed
sw: Jisajili, malisho yetu ya RSS

source: Products
sw: Bidhaa

source: There are no products for this category yet
sw: Hakuna bidhaa kwa hiki kikundi

source: TOP CATEGORIES
sw: Vikundi vya juu

source: Men Clothing
sw: Nguo za wanaume

source: Women Clothing
sw: Nguo za wanawake

source: HELP
sw: Usaudizi

source: Delivery
sw: Utoaji

source: Returns
sw: Kurudisha

source: Secure Payments
sw: Malipo Salama

source: Contact Us
sw: Tupigie

source: ABOUT US
sw: Kutuhusu

source: Careers
sw: Kazi

source: Terms & Conditions of Sales
sw: Masharti na hali ya mauzo

source: Privacy Policy
sw: Sera ya faragha

source: Responsibility
sw: Ujibu

source: FEEDBACK
sw: MAONI

source: Previous
sw: Kabla

source: Page
sw: Ukurasa

source: of
sw: wa

source: Next
sw: Inayofuata

source: Review this product
sw: Tathmini bidhaa hii

source: Go back
sw: Rudi nyuma

source: Add a review
sw: Ongeza tathmini

source: Products containing
sw: Bidhaa zinazo neno

source: Found
sw: Imeoatikana

source: result
sw: Matokeo
