Repository: moses-mugoya/Online-Cloth-Shopping-System
Catalog: orders/locale/*/LC_MESSAGES/django.po
Languages: sw

source: Address of delivery
sw: Anwani ya utoaji

source: Specification of product
sw: Ufafanuzi wa bidhaa

source: Phone number
sw: Nambari ya simu

source: Please specify the sizes of your products in the specification area. Be precise and clear
sw: Tafadhali taja ukubwa wa bidhaa zako kwenye eneo la vipimo. Kuwa sahihi na wazi

source: Place Order
sw: Agiza

source: Your Order
sw: Agizo lako

source: Quantity
sw: Wingi

source: Product
sw: bidhaa

source: Unit price
sw: Thamani ya kitengo

source: Price
sw: Thamani

source: Thank you
sw: Asante

source: Your order has been successfully completed. Your order number is
sw: Agizo lako limekamilika kwa ufanisi. Nambari yako ya utaratibu ni

source: Please stay logged in while we process your order. Once we are done, we will update the status of your order
sw: Tafadhali salia ndani wakati tunapofanya utaratibu wako. Mara tukifanywa, tutasasisha hali ya agizo lako

source: View the status of your order in your dashboard
sw: Tazama hali ya agizo lako kwenye dashibodi yako
